app/Views/layout/template.php

SELECT `expired_date`
FROM `users`
WHERE `id` = '2'
---
                        // Kita ambil langsung dari DB biar real-time
                        $db = \Config\Database::connect();
                        $idUser = session()->get('id');
                        $user = $db->table('users')->select('expired_date')->where('id', $idUser)->get()->getRowArray();