app/Controllers/Auth.php

SELECT *
FROM `users`
WHERE `email` = 'azizahbws@gmail.com'
 LIMIT 1
---
    public function process()
    {
        $session = session();
        $model = new UserModel();

        $email = $this->request->getVar('email');
        $password = $this->request->getVar('password');

        $data = $model->where('email', $email)->first();