app/Controllers/Catatan.php

    public function index()
    {
        $id_guru = session()->get('id'); // Ambil ID Guru
        $kelas_id = $this->request->getGet('kelas_id');

        // 1. Ambil data kelas untuk dropdown (Hanya milik guru ini)
        $kelas = $this->kelasModel->where('user_id', $id_guru)->findAll();
---
SELECT *
FROM `kelas`
WHERE `user_id` = '2'