app/Models/ModulAjarModel.php

SELECT *
FROM `modul_ajar`
WHERE `user_id` = '2'
ORDER BY `created_at` DESC
---
    public function getAllByUser($userId)
    {
        return $this->where('user_id', $userId)
                    ->orderBy('created_at', 'DESC')
                    ->findAll();

SELECT *
FROM `modul_ajar`
WHERE `id` = '13'
AND `user_id` = '2'
 LIMIT 1
---
    public function getOneByUser($modulId, $userId)
    {
        return $this->where('id', $modulId)
                    ->where('user_id', $userId)
                    ->first();